## Importacion de librerias y acceso a contenedor sql

In [8]:
import os
import pandas as pd
from dotenv import load_dotenv
from sqlalchemy import create_engine

load_dotenv("credenciales/practica.env")

host = os.getenv("MYSQL_HOST", "127.0.0.1")
port = os.getenv("MYSQL_PORT", "3306")
db = os.getenv("MYSQL_DB", "practica_ejercicios")

user = os.getenv("MYSQL_USER")
pwd  = os.getenv("MYSQL_PASSWORD")  # SOLO esta


engine = create_engine(f"mysql+pymysql://{user}:{pwd}@{host}:{port}/{db}")

In [9]:
print("MYSQL_DB existe?:", os.getenv("MYSQL_DB"))

MYSQL_DB existe?: practica_ejercicios

In [10]:
print("cwd:", os.getcwd())
print("MYSQL_USER:", os.getenv("MYSQL_USER"))
print("MYSQL_PASSWORD existe?:", os.getenv("MYSQL_PASSWORD") is not None)

cwd: c:\Users\workw\Documents\practicar programacion\sql
MYSQL_USER: usuario_practica
MYSQL_PASSWORD existe?: True

## Leer ODS y guardar en MySQL

In [11]:
# Leer ODS desde tu PC (ruta local)
df_clientes = pd.read_excel("Video2/CLIENTES.ods", engine="odf")
df_productos = pd.read_excel("Video2/PRODUCTOS1.ods", engine="odf")

In [12]:
# Guardar a MySQL
df_clientes.to_sql("clientes", engine, if_exists="replace", index=False)
df_productos.to_sql("productos", engine, if_exists="replace", index=False)

40

## Ejercicios

### SELECT, FROM, WHERE

In [13]:
pd.read_sql("SHOW TABLES;", engine)

  Tables_in_practica_ejercicios
0                      clientes
1                     productos

In [14]:
pd.read_sql("DESCRIBE productos;", engine)

            Field        Type Null Key Default Extra
0  CÓDIGOARTÍCULO        text  YES        None
1         SECCIÓN        text  YES        None
2  NOMBREARTÍCULO        text  YES        None
3          PRECIO      double  YES        None
4           FECHA    datetime  YES        None
5       IMPORTADO  tinyint(1)  YES        None
6    PAÍSDEORIGEN        text  YES        None
7            FOTO      double  YES        None

In [15]:
pd.read_sql("SELECT * FROM productos;", engine)

,CÓDIGOARTÍCULO,SECCIÓN,NOMBREARTÍCULO,PRECIO,FECHA,IMPORTADO,PAÍSDEORIGEN,FOTO
0,AR01,FERRETERÍA,DESTORNILLADOR,6.6280,2000-10-22,0,ESPAÑA,None
1,AR02,CONFECCIÓN,TRAJE CABALLERO,284.5769,2002-03-11,0,ITALIA,None
2,AR03,JUGUETERÍA,COCHE TELEDIRIGIDO,159.4462,2002-05-26,0,MARRUECOS,None
3,AR04,DEPORTES,RAQUETA TENIS,93.4694,2000-03-20,0,USA,None
4,AR06,DEPORTES,MANCUERNAS,60.0000,2000-09-13,0,USA,None
5,AR07,CONFECCIÓN,SERRUCHO,30.2045,2001-03-23,0,FRANCIA,None
6,AR08,JUGUETERÍA,CORREPASILLOS,103.3356,2000-04-11,0,JAPÓN,None
7,AR09,CONFECCIÓN,PANTALÓN SEÑORA,174.2310,2000-01-10,0,MARRUECOS,None
8,AR10,JUGUETERÍA,CONSOLA VIDEO,442.5444,2002-09-24,0,USA,None
9,AR11,CERÁMICA,TUBOS,168.4253,2000-02-04,0,CHINA,None
10,AR12,FERRETERÍA,LLAVE INGLESA,24.3986,2001-05-23,0,USA,None
11,AR13,CONFECCIÓN,CAMISA CABALLERO,67.1306,2002-08-11,0,ESPAÑA,None
12,AR14,JUGUETERÍA,TREN ELÉCTRICO,1505.3766,2001-07-03,0,JAPÓN,None
13,AR15,CERÁMICA,PLATO DECORATIVO,54.0911,2000-06-07,0,CHINA,None
14,AR16,FERRETERÍA,ALICATES,6.7362,2000-04-17,0,ITALIA,None
15,AR17,JUGUETERÍA,MUÑECA ANDADORA,105.0593,2001-01-04,0,ESPAÑA,None
16,AR18,DEPORTES,PISTOLA OLÍMPICA,46.7347,2001-02-02,0,SUECIA,None
17,AR19,CONFECCIÓN,BLUSA SRA.,101.0566,2000-03-18,0,CHINA,None
18,AR20,CERÁMICA,JUEGO DE TE,43.2728,2001-01-15,0,CHINA,None
19,AR21,CERÁMICA,CENICERO,19.7468,2001-07-02,0,JAPÓN,None
20,AR22,FERRETERÍA,MARTILLO,11.3952,2001-09-04,0,ESPAÑA,None
21,AR23,CONFECCIÓN,CAZADORA PIEL,522.6930,2001-07-10,0,ITALIA,None
22,AR24,DEPORTES,BALÓN RUGBY,111.6440,2000-11-11,0,USA,None
23,AR25,DEPORTES,BALÓN BALONCESTO,75.2731,2001-06-25,0,JAPÓN,None
24,AR26,JUGUETERÍA,FUERTE DE SOLDADOS,143.7020,2000-11-25,0,JAPÓN,None
25,AR27,CONFECCIÓN,ABRIGO CABALLERO,500000.0000,2002-04-05,0,ITALIA,None
26,AR28,DEPORTES,BALÓN FÚTBOL,43.9147,2002-07-04,0,ESPAÑA,None
27,AR29,CONFECCIÓN,ABRIGO SRA,360.0736,2001-05-03,0,MARRUECOS,None
28,AR30,FERRETERÍA,DESTORNILLADOR,9.0584,2002-02-20,0,FRANCIA,None
29,AR31,JUGUETERÍA,PISTOLA CON SONIDOS,57.2500,2001-04-15,0,ESPAÑA,None
30,AR32,DEPORTES,CRONÓMETRO,439.1764,2002-01-03,0,USA,None
31,AR33,CERÁMICA,MACETA,29.0434,2000-02-23,0,ESPAÑA,None
32,AR34,OFICINA,PIE DE LÁMPARA,39.7606,2001-05-27,0,TURQUÍA,None
33,AR35,FERRETERÍA,LIMA GRANDE,22.0692,2002-08-10,0,ESPAÑA,None
34,AR36,FERRETERÍA,JUEGO DE BROCAS,15.0950,2002-07-04,0,TAIWÁN,None
35,AR37,CONFECCIÓN,CINTURÓN DE PIEL,4.3273,2002-05-12,0,ESPAÑA,None
36,AR38,DEPORTES,CAÑA DE PESCA,270.0000,2000-02-14,0,USA,None
37,AR39,CERÁMICA,JARRA CHINA,127.7704,2002-09-02,0,CHINA,None
38,AR40,DEPORTES,BOTA ALPINISMO,144.0000,2002-05-05,0,ESPAÑA,None
39,AR41,DEPORTES,PALAS DE PING PONG,21.6000,2002-02-02,0,ESPAÑA,None

In [16]:
pd.read_sql("SELECT nombreartículo, precio, paísdeorigen FROM productos WHERE PAÍSDEORIGEN = 'españa' OR PRECIO >350;", engine)

         nombreartículo       precio paísdeorigen
0        DESTORNILLADOR       6.6280       ESPAÑA
1         CONSOLA VIDEO     442.5444          USA
2      CAMISA CABALLERO      67.1306       ESPAÑA
3        TREN ELÉCTRICO    1505.3766        JAPÓN
4       MUÑECA ANDADORA     105.0593       ESPAÑA
5              MARTILLO      11.3952       ESPAÑA
6         CAZADORA PIEL     522.6930       ITALIA
7      ABRIGO CABALLERO  500000.0000       ITALIA
8          BALÓN FÚTBOL      43.9147       ESPAÑA
9            ABRIGO SRA     360.0736    MARRUECOS
10  PISTOLA CON SONIDOS      57.2500       ESPAÑA
11           CRONÓMETRO     439.1764          USA
12               MACETA      29.0434       ESPAÑA
13          LIMA GRANDE      22.0692       ESPAÑA
14     CINTURÓN DE PIEL       4.3273       ESPAÑA
15       BOTA ALPINISMO     144.0000       ESPAÑA
16   PALAS DE PING PONG      21.6000       ESPAÑA

#### Nota: en select y FROM, no importa las mayusculas pero despues de WHERE si importan, mejor escribir todo en mayusculas y no olvidar las tildes

### Order by

In [17]:
pd.read_sql("SELECT SECCIÓN, NOMBREARTÍCULO FROM productos WHERE SECCIÓN = 'deportes' OR SECCIÓN= 'cerámica' ORDER BY SECCIÓN;", engine)

     SECCIÓN      NOMBREARTÍCULO
0   CERÁMICA               TUBOS
1   CERÁMICA    PLATO DECORATIVO
2   CERÁMICA         JUEGO DE TE
3   CERÁMICA            CENICERO
4   CERÁMICA              MACETA
5   CERÁMICA         JARRA CHINA
6   DEPORTES       RAQUETA TENIS
7   DEPORTES          MANCUERNAS
8   DEPORTES    PISTOLA OLÍMPICA
9   DEPORTES         BALÓN RUGBY
10  DEPORTES    BALÓN BALONCESTO
11  DEPORTES        BALÓN FÚTBOL
12  DEPORTES          CRONÓMETRO
13  DEPORTES       CAÑA DE PESCA
14  DEPORTES      BOTA ALPINISMO
15  DEPORTES  PALAS DE PING PONG

In [18]:
pd.read_sql("SELECT SECCIÓN, NOMBREARTÍCULO FROM productos WHERE SECCIÓN = 'deportes' OR SECCIÓN= 'cerámica' ORDER BY SECCIÓN DESC;", engine)

     SECCIÓN      NOMBREARTÍCULO
0   DEPORTES       RAQUETA TENIS
1   DEPORTES          MANCUERNAS
2   DEPORTES    PISTOLA OLÍMPICA
3   DEPORTES         BALÓN RUGBY
4   DEPORTES    BALÓN BALONCESTO
5   DEPORTES        BALÓN FÚTBOL
6   DEPORTES          CRONÓMETRO
7   DEPORTES       CAÑA DE PESCA
8   DEPORTES      BOTA ALPINISMO
9   DEPORTES  PALAS DE PING PONG
10  CERÁMICA               TUBOS
11  CERÁMICA    PLATO DECORATIVO
12  CERÁMICA         JUEGO DE TE
13  CERÁMICA            CENICERO
14  CERÁMICA              MACETA
15  CERÁMICA         JARRA CHINA

#### Nota: DESC al lado derecho de la variable la hace decendente

In [19]:
pd.read_sql("SELECT SECCIÓN, NOMBREARTÍCULO FROM productos WHERE SECCIÓN = 'deportes' OR SECCIÓN= 'cerámica' ORDER BY SECCIÓN ASC;", engine)

     SECCIÓN      NOMBREARTÍCULO
0   CERÁMICA               TUBOS
1   CERÁMICA    PLATO DECORATIVO
2   CERÁMICA         JUEGO DE TE
3   CERÁMICA            CENICERO
4   CERÁMICA              MACETA
5   CERÁMICA         JARRA CHINA
6   DEPORTES       RAQUETA TENIS
7   DEPORTES          MANCUERNAS
8   DEPORTES    PISTOLA OLÍMPICA
9   DEPORTES         BALÓN RUGBY
10  DEPORTES    BALÓN BALONCESTO
11  DEPORTES        BALÓN FÚTBOL
12  DEPORTES          CRONÓMETRO
13  DEPORTES       CAÑA DE PESCA
14  DEPORTES      BOTA ALPINISMO
15  DEPORTES  PALAS DE PING PONG

#### 1. Ordena todos los productos por precio (de menor a mayor)

In [20]:
pd.read_sql("SELECT NOMBREARTÍCULO, PRECIO FROM productos ORDER BY NOMBREARTÍCULO ASC", engine)

         NOMBREARTÍCULO       PRECIO
0      ABRIGO CABALLERO  500000.0000
1            ABRIGO SRA     360.0736
2              ALICATES       6.7362
3      BALÓN BALONCESTO      75.2731
4          BALÓN FÚTBOL      43.9147
5           BALÓN RUGBY     111.6440
6            BLUSA SRA.     101.0566
7        BOTA ALPINISMO     144.0000
8      CAMISA CABALLERO      67.1306
9         CAÑA DE PESCA     270.0000
10        CAZADORA PIEL     522.6930
11             CENICERO      19.7468
12     CINTURÓN DE PIEL       4.3273
13   COCHE TELEDIRIGIDO     159.4462
14        CONSOLA VIDEO     442.5444
15        CORREPASILLOS     103.3356
16           CRONÓMETRO     439.1764
17       DESTORNILLADOR       6.6280
18       DESTORNILLADOR       9.0584
19   FUERTE DE SOLDADOS     143.7020
20          JARRA CHINA     127.7704
21      JUEGO DE BROCAS      15.0950
22          JUEGO DE TE      43.2728
23          LIMA GRANDE      22.0692
24        LLAVE INGLESA      24.3986
25               MACETA      29.0434
26           MANCUERNAS      60.0000
27             MARTILLO      11.3952
28      MUÑECA ANDADORA     105.0593
29   PALAS DE PING PONG      21.6000
30      PANTALÓN SEÑORA     174.2310
31       PIE DE LÁMPARA      39.7606
32  PISTOLA CON SONIDOS      57.2500
33     PISTOLA OLÍMPICA      46.7347
34     PLATO DECORATIVO      54.0911
35        RAQUETA TENIS      93.4694
36             SERRUCHO      30.2045
37      TRAJE CABALLERO     284.5769
38       TREN ELÉCTRICO    1505.3766
39                TUBOS     168.4253

In [21]:
pd.read_sql("SELECT * FROM productos WHERE SECCIÓN = 'CERÁMICA' OR SECCIÓN = 'DEPORTES' ORDER BY SECCIÓN, PRECIO DESC",engine)

,CÓDIGOARTÍCULO,SECCIÓN,NOMBREARTÍCULO,PRECIO,FECHA,IMPORTADO,PAÍSDEORIGEN,FOTO
0,AR11,CERÁMICA,TUBOS,168.4253,2000-02-04,0,CHINA,None
1,AR39,CERÁMICA,JARRA CHINA,127.7704,2002-09-02,0,CHINA,None
2,AR15,CERÁMICA,PLATO DECORATIVO,54.0911,2000-06-07,0,CHINA,None
3,AR20,CERÁMICA,JUEGO DE TE,43.2728,2001-01-15,0,CHINA,None
4,AR33,CERÁMICA,MACETA,29.0434,2000-02-23,0,ESPAÑA,None
5,AR21,CERÁMICA,CENICERO,19.7468,2001-07-02,0,JAPÓN,None
6,AR32,DEPORTES,CRONÓMETRO,439.1764,2002-01-03,0,USA,None
7,AR38,DEPORTES,CAÑA DE PESCA,270.0000,2000-02-14,0,USA,None
8,AR40,DEPORTES,BOTA ALPINISMO,144.0000,2002-05-05,0,ESPAÑA,None
9,AR24,DEPORTES,BALÓN RUGBY,111.6440,2000-11-11,0,USA,None
10,AR04,DEPORTES,RAQUETA TENIS,93.4694,2000-03-20,0,USA,None
11,AR25,DEPORTES,BALÓN BALONCESTO,75.2731,2001-06-25,0,JAPÓN,None
12,AR06,DEPORTES,MANCUERNAS,60.0000,2000-09-13,0,USA,None
13,AR18,DEPORTES,PISTOLA OLÍMPICA,46.7347,2001-02-02,0,SUECIA,None
14,AR28,DEPORTES,BALÓN FÚTBOL,43.9147,2002-07-04,0,ESPAÑA,None
15,AR41,DEPORTES,PALAS DE PING PONG,21.6000,2002-02-02,0,ESPAÑA,None

In [22]:
pd.read_sql("SELECT * FROM productos WHERE SECCIÓN = 'CERÁMICA' OR SECCIÓN = 'DEPORTES' ORDER BY SECCIÓN, PAÍSDEORIGEN",engine)

,CÓDIGOARTÍCULO,SECCIÓN,NOMBREARTÍCULO,PRECIO,FECHA,IMPORTADO,PAÍSDEORIGEN,FOTO
0,AR11,CERÁMICA,TUBOS,168.4253,2000-02-04,0,CHINA,None
1,AR15,CERÁMICA,PLATO DECORATIVO,54.0911,2000-06-07,0,CHINA,None
2,AR20,CERÁMICA,JUEGO DE TE,43.2728,2001-01-15,0,CHINA,None
3,AR39,CERÁMICA,JARRA CHINA,127.7704,2002-09-02,0,CHINA,None
4,AR33,CERÁMICA,MACETA,29.0434,2000-02-23,0,ESPAÑA,None
5,AR21,CERÁMICA,CENICERO,19.7468,2001-07-02,0,JAPÓN,None
6,AR28,DEPORTES,BALÓN FÚTBOL,43.9147,2002-07-04,0,ESPAÑA,None
7,AR40,DEPORTES,BOTA ALPINISMO,144.0000,2002-05-05,0,ESPAÑA,None
8,AR41,DEPORTES,PALAS DE PING PONG,21.6000,2002-02-02,0,ESPAÑA,None
9,AR25,DEPORTES,BALÓN BALONCESTO,75.2731,2001-06-25,0,JAPÓN,None
10,AR18,DEPORTES,PISTOLA OLÍMPICA,46.7347,2001-02-02,0,SUECIA,None
11,AR04,DEPORTES,RAQUETA TENIS,93.4694,2000-03-20,0,USA,None
12,AR06,DEPORTES,MANCUERNAS,60.0000,2000-09-13,0,USA,None
13,AR24,DEPORTES,BALÓN RUGBY,111.6440,2000-11-11,0,USA,None
14,AR32,DEPORTES,CRONÓMETRO,439.1764,2002-01-03,0,USA,None
15,AR38,DEPORTES,CAÑA DE PESCA,270.0000,2000-02-14,0,USA,None

### Consultas de agrupacion

#### Funciones de agregado de SQL
- AVG: PROMEDIO
- COUNT: CONTADOR DE REGISTROS
- SUM: SUMA
- MAX: MAXIMO
- MIN: MINIMO

In [25]:
pd.read_sql("SELECT SECCIÓN, SUM(PRECIO) FROM productos GROUP BY SECCIÓN;",engine)

      SECCIÓN  SUM(PRECIO)
0  FERRETERÍA      95.3806
1  CONFECCIÓN  501544.2935
2  JUGUETERÍA    2516.7141
3    DEPORTES    1305.8123
4    CERÁMICA     442.3498
5     OFICINA      39.7606

#### Notas: para que sirve group by?

#### Nota: Se puede crear un alias

In [27]:
pd.read_sql("SELECT SECCIÓN, SUM(PRECIO) AS SUMA_ARTICULOS FROM productos GROUP BY SECCIÓN ORDER BY SUMA_ARTICULOS;",engine)

      SECCIÓN  SUMA_ARTICULOS
0     OFICINA         39.7606
1  FERRETERÍA         95.3806
2    CERÁMICA        442.3498
3    DEPORTES       1305.8123
4  JUGUETERÍA       2516.7141
5  CONFECCIÓN     501544.2935

In [ ]:
# porque group by y porque no funciona asc?
pd.read_sql("SELECT SECCIÓN, AVG(PRECIO) AS MEDIA_ARTICULOS FROM productos GROUP BY SECCIÓN HAVING SECCIÓN = 'CERÁMICA' OR SECCIÓN = 'DEPORTES';",engine)

    SECCIÓN  MEDIA_ARTICULOS
0  DEPORTES       130.581230
1  CERÁMICA        73.724967

In [ ]:
#### Ejercicios dejados

In [ ]:
#1. 
pd.read_sql("DESCRIBE clientes",engine)

           Field    Type Null Key Default Extra
0  CÓDIGOCLIENTE    text  YES        None
1        EMPRESA    text  YES        None
2      DIRECCIÓN    text  YES        None
3      POBLACIÓN    text  YES        None
4       TELÉFONO  bigint  YES        None
5    RESPONSABLE    text  YES        None
6      HISTORIAL  double  YES        None

In [ ]:
pd.read_csv("SELECT DIRECCIÓN, TELÉFONO, POBLACIÓN FROM clientes ",engine)